------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  \\wsl.localhost\Debian\home\lsys\social_proof_stars\github_exp\baltest\src\../output/stata-log.txt
  log type:  text
 opened on:   9 Jun 2023, 18:04:38

. 
. version 13              // Still on version 13 :(

. 
. // -----------------------------------------------------------------------------
. * Repo baselines
. // -----------------------------------------------------------------------------
. use "../../get_baseline_profile/output/repo_baselines.dta", clear

. 
. gen python_lang = (language == "Python")

. 
. local vars_to_encode "language"

. foreach var of local vars_to_encode {
  2.     rename `var' `var'_str
  3.     encode `var'_str, gen(`var')
  4. }

. 
. global repo_baselines year_created fork size_mb stargazers_count watchers_count has_issues forks open_issues subscribe
> rs_count n_topic python_lang

. 
. su $global

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
year_created |       582    2022.311    1.868624       2012       2023
        fork |       582    .0395189    .1949936          0          1
     treated |       582    .1666667    .3729986          0          1
    treated2 |       582    .2079038    .4975735          0          2
     size_mb |       582    7.847388    29.42956          0   306.3408
-------------+--------------------------------------------------------
stargazers~t |       582      69.189    469.2003          0       5777
watchers_c~t |       582      69.189    469.2003          0       5777
language_str |         0
  has_issues |       582    .9570447    .2029308          0          1
       forks |       582    19.87113    115.3656          0       1682
-------------+--------------------------------------------------------
 open_issues |       582    4.568729    27.54732          0        546
subscriber~t |       582    4.328179    12.98419          0        109
    n_topics |       582    1.762887    3.375338          0         20
 python_lang |       582     .862543    .3446254          0          1
    language |       571    12.49387    1.811624          1         17

. 
. #delimit;
delimiter now ;
. iebaltab 
>         $repo_baselines
>         ,
>         total
>         groupvar(treated)
>         // ftest
>         star(.1 .05 .01)
>         stats(pair(nrmd))
>         nonote
>         grplabels(
>                 0 Control @
>                 1 Treated @
>                 )       
>         rowlabels(
>                 year_created "Year created" @
>                 fork "Forked = 1" @
>                 size_mb "Repository size" @
>                 stargazers_count "Stars" @
>                 has_issues "Has issues = 1" @
>                 forks "Number of forks" @
>                 open_issues "Number of open issues" @
>                 subscribers_count "Subscribers" @
>                 n_topics "Number of topics listed" @
>                 python_lang     "Python = 1"
>                 )
>         savetex(../output/baltest-repo-treated-01.tex) 
>         replace
> ;

    Balance table saved in LaTeX format to: ../output/baltest-repo-treated-01.tex

. #delimit;
delimiter now ;
. iebaltab 
>         $repo_baselines
>         ,
>         total
>         groupvar(treated2)
>         // ftest
>         star(.1 .05 .01)
>         stats(pair(nrmd))
>         nonote
>         grplabels(
>                 0 Control @
>                 1 Treated (low) @
>                 2 Treated (high) @
>                 )       
>         rowlabels(
>                 year_created "Year created" @
>                 fork "Forked = 1" @
>                 size_mb "Repository size" @
>                 stargazers_count "Stars" @
>                 has_issues "Has issues = 1" @
>                 forks "Number of forks" @
>                 open_issues "Number of open issues" @
>                 subscribers_count "Subscribers" @
>                 n_topics "Number of topics listed" @
>                 python_lang     "Python = 1"
>                 )
>         savetex(../output/baltest-repo-treated-012.tex) 
>         replace
> ;

    Balance table saved in LaTeX format to: ../output/baltest-repo-treated-012.tex

. #delimit cr
delimiter now cr
. 
. // -----------------------------------------------------------------------------
. * User baselines
. // -----------------------------------------------------------------------------
. use "../../get_baseline_profile/output/user_baselines.dta", clear

. 
. gen org = (type=="Organization")

. global user_baselines public_repos public_gists followers following year_created year_updated org list_co list_email l
> ist_blog list_bio bio_size

. #delimit;
delimiter now ;
. iebaltab 
>         $user_baselines
>         ,
>         total
>         groupvar(treated)
>         // ftest
>         star(.1 .05 .01)
>         stats(pair(nrmd))
>         nonote
>                 grplabels(
>                 0 Control @
>                 1 Treated @
>                 )       
>         rowlabels(
>                 public_repos "Number of repositories" @ 
>                 public_gists "Number of gists" @
>                 followers "Number of followers" @
>                 following "Number of people followed" @
>                 year_created "Year created" @
>                 year_updated "Year updated" @
>                 org "Organization" @
>                 list_co "List company" @
>                 list_email "List email" @
>                 list_blog "List personal site" @
>                 list_bio "List brief bio" @
>                 bio_size "Brief bio length" @
>                 )
>         savetex(../output/baltest-user-treated-01.tex) 
>         replace
> ;

    Balance table saved in LaTeX format to: ../output/baltest-user-treated-01.tex

. #delimit;
delimiter now ;
. iebaltab 
>         $user_baselines
>         ,
>         total
>         groupvar(treated2)
>         // ftest
>         star(.1 .05 .01)
>         stats(pair(nrmd))
>         nonote
>                 grplabels(
>                 0 Control @
>                 1 Treated (low) @
>                 2 Treated (high) @
>                 )       
>         rowlabels(
>                 public_repos "Number of repositories" @ 
>                 public_gists "Number of gists" @
>                 followers "Number of followers" @
>                 following "Number of people followed" @
>                 year_created "Year created" @
>                 year_updated "Year updated" @
>                 org "Organization" @
>                 list_co "List company" @
>                 list_email "List email" @
>                 list_blog "List personal site" @
>                 list_bio "List brief bio" @
>                 bio_size "Brief bio length" @
>                 )
>         savetex(../output/baltest-user-treated-012.tex) 
>         replace
> ;

    Balance table saved in LaTeX format to: ../output/baltest-user-treated-012.tex

. 
end of do-file

